In [1]:
from bs4 import BeautifulSoup
from splinter import Browser
from webdriver_manager.chrome import ChromeDriverManager

import datetime
import requests

import pandas as pd
import numpy as np

## Golf Leaders of 2021

In [2]:
# Site URL
url = 'https://www.espn.com/golf/leaders'
# Retrieve page with the request module
response = requests.get(url)

In [3]:
soup = BeautifulSoup(response.text, 'html.parser')
# print(soup.prettify())

In [4]:
# Read in all html tables and put into dataframes
tables = pd.read_html(url)

In [5]:
# Empty list
golf_dfs = []

# Create list of dataframes
for df in tables:
    golf_dfs.append(df)

In [6]:
# Select dataframes that have actual statistics
money_leaders = golf_dfs[1]
total_cuts_made = golf_dfs[2]
putting_avg = golf_dfs[3]
fedex_cup_points = golf_dfs[4]
avg_drive = golf_dfs[5]
drive_accuracy = golf_dfs[6]

# Create list of dataframes
list_of_dfs = [money_leaders, total_cuts_made, 
               putting_avg, fedex_cup_points, 
               avg_drive, drive_accuracy]

# Empty List
new_list = []

# Re-format the dataframe. Drop first column. Store and rename column headers. 
# Strip rank from beginning of player string. Place in new list
for df in list_of_dfs:
    df = df.drop(columns=[0])
    player_header = df.loc[0][1]
    stat_header = df.loc[0][2]
    df = df.rename(columns={1: player_header, 2: stat_header}).drop([0,6])
    df[player_header] = df[player_header].str[3:]
    new_list.append(df)

#### Money Leaders

In [7]:
new_list[0]

              PLAYER         AMOUNT
1           Jon Rahm  $6,111,433.00
2  Bryson DeChambeau  $6,018,847.00
3      Justin Thomas  $5,907,945.00
4    Patrick Cantlay  $5,620,030.00
5     Harris English  $5,529,727.00

#### Total Cuts Made

In [8]:
new_list[1]

            PLAYER CUTS
1         Tom Hoge   28
2       Sungjae Im   27
3  Patrick Rodgers   26
4      Adam Schenk   26
5  Sebasti치n Mu침oz   25

#### Putting Average

In [9]:
new_list[2]

           PLAYER    AVG
1   Cameron Smith  1.705
2    Patrick Reed  1.706
3  Anirban Lahiri  1.707
4   Peter Malnati  1.710
5  Patton Kizzire  1.710

#### FedEx Cup Points Leaders

In [10]:
new_list[3]

              PLAYER POINTS
1    Patrick Cantlay   2014
2     Harris English   1889
3           Jon Rahm   1823
4  Bryson DeChambeau   1802
5      Jordan Spieth   1742

#### Average Drive

In [11]:
new_list[4]

              PLAYER   YARDS
1  Bryson DeChambeau  322.35
2       Rory McIlroy  318.72
3      Cameron Champ  318.22
4      Wyndham Clark  315.54
5        Will Gordon  315.01

#### Driving Accuracy

In [12]:
new_list[5]

         PLAYER    PCT
1  Brendon Todd  75.10
2  Brian Stuard  72.48
3   Ryan Armour  72.20
4   Chez Reavie  71.81
5    Ryan Moore  71.40